Autodesk.Revit.DB.Curve.ComputeClosestPoints(Autodesk.Revit.DB.Curve,System.Boolean,System.Boolean,System.Boolean,System.Collections.Generic.IList{Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves}@)
Find the closest points between two curves.
Closest points mean closest pairs of points, each pair consisting of a point on this, say P1, and a point on other curve, say P2.
P1 and P2 are closest locally.
Each pairs of closest points will be represented by the corresponding parameter values with respect to the two curves and the 3d points.
A closest pair is also known as a pair of critical points of the distance function between points of the two curves.
If the input parameter returnAllCriticalPoints is set to false, then the function will return only pairs with minimum distance.
otherCurve:
The specified curve used to compute closest points to this curve.
withinThisCurveBounds:
If this parameter is true only the solutions that are between this curve bounds will be returned.
This curve must be bound if this parameter is true.
withinOtherCurveBounds:
If this parameter is true only the solutions that are between other curve bounds will be returned.
The other curve must be bound if this parameter is true.
returnAllCriticalPnts:
The input parameter returnAllCriticalPnts is used to tell if all the critical points of the
distance function are to be returned.
resultList:
Output parameter that will contain the results collection.
Remarks:
The output list of closest points contains one entry for each pair of closest points.
The following is the meaning of every ClosestPointsPairBetweenTwoCurves's members:
XYZPointOnFirstCurve is the closest point on the first curve;XYZPointOnSecondCurve is the closest point on the second curve;ParameterOnFirstCurve is the raw (not normalized) parameter on the first curveParameterOnSecondCurve is the raw (not normalized) parameter on the second curveDistance is the distance from the closest point on the first curve to the closest point on the second curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when otherCurve argument is null.
Thrown when resultArray is null.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when withinThisCurveBounds is true and this curve is unbounded.
Thrown when withinOtherCurveBounds is true and other curve is unbounded.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the method failed. For example the problem has infinitely many solutions
such as two parallel lines or two concentric circles, or in other singular cases that the method currently cannot handle,
such as evaluating the closest points between a spline and a line, and the spline contains
a flat segment (all points on the segment have zero curvature), and the closest points
lie within that flat segment.
Since:
2018.1

Autodesk.Revit.DB.Curve.SetGraphicsStyleId(Autodesk.Revit.DB.ElementId)
Sets the graphics style id for this curve.
Remarks:
If the curve is marked as read-only (because it was extracted directly from
a Revit element or collection/aggregation object), calling this method
causes the object to be changed to carry a disconnected copy of the original curve.  The
modification will not affect the original curve or the object that supplied it.
Many methods in the Revit API will not use the graphics style associated to this curve.  For
example, curves used as portions of the sketch of an element will not read this property.
Newly created curve elements
will not use this value either, as they inherit their graphical properties from their associated category.
id: The id of the GraphicsStyle element from which to apply the curve properties.

Autodesk.Revit.DB.Curve.Clone
Returns a copy of this curve.
Returns: A copy of this curve.

Autodesk.Revit.DB.Curve.Project(Autodesk.Revit.DB.XYZ)
Projects the specified point on this curve.
point: The point to be projected.
Returns: Geometric information if projection is successful.
Remarks:
The following is the meaning of every IntersectionResult's members:
XYZPoint is the nearest point on the curve;Parameter is the unnormalized parameter on the curve (use ComputeNormalizedParameter to compute the normalized value)Distance is the distance from the point to the curve (equivalent to Distance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the curve is an arc and either its radius is zero or the input point is the center of the arc.
Thrown when the curve is an elliptical arc and the input point is one of the foci of the elliptical arc.

Autodesk.Revit.DB.Curve.Intersect(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.IntersectionResultArray@)
Calculates the intersection of this curve with the specified curve and returns the intersection results.
curve: The specified curve to intersect with this curve.
resultArray: Provides more information about the intersection.
Returns:
SetComparisonResult.Overlap - One or more intersections were encountered.  The output argument has the details.
SetComparisonResult.Subset - The inputs are parallel lines with only one common intersection point, or
the curve used to invoke the intersection check is a line entirely within the unbound line passed as argument curve.
If the former, the output argument has the details of the intersection point.
SetComparisonResult.Superset - The input curve is entirely within the unbound line used to invoke the intersection check.
SetComparisonResult.Disjoint - There is no intersection found between the two curves.
SetComparisonResult.Equal - The two curves are identical.
Remarks:
The array of the intersection results contains one entry for each point where curves intersect.
The following is the meaning of IntersectionResult members:
XYZPoint is the evaluated intersection pointUVPoint.U is the unnormalized parameter on this curve (use ComputeNormalizedParameter to compute the normalized value).UVPoint.V is the unnormalized parameter on the specified curve (use ComputeNormalizedParameter to compute the normalized value).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified curve is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to calculate the intersection.

Autodesk.Revit.DB.Curve.Intersect(Autodesk.Revit.DB.Curve)
Calculates the intersection of this curve with the specified curve.
Calculates the intersection of this curve with the specified curve.
curve: The specified curve to intersect with this curve.
Returns:
SetComparisonResult.Overlap - One or more intersections were encountered.
SetComparisonResult.Subset - The inputs are parallel lines with only one common intersection point, or
the curve used to invoke the intersection check is a line entirely within the unbound line passed as argument curve.
SetComparisonResult.Superset - The input curve is entirely within the unbound line used to invoke the intersection check.
SetComparisonResult.Disjoint - There is no intersection found between the two curves.
SetComparisonResult.Equal - The two curves are identical.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The specified curve is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to calculate the intersection.

Autodesk.Revit.DB.Curve.IsInside(System.Double,System.Int32@)
Indicates whether the specified parameter value is within this curve's bounds and outputs the end index.
parameter: The raw curve parameter to be evaluated.
end: The end index is equal to 0 for the start point, 1 for the end point, or -1 if the parameter is not at the end.
Returns: True if the parameter is within the curve's bounds, otherwise false.
Remarks: Always returns true if this curve is unbound.

Autodesk.Revit.DB.Curve.IsInside(System.Double)
Indicates whether the specified parameter value is within this curve's bounds.
Indicates whether the specified parameter value is within this curve's bounds.
parameter: The raw curve parameter to be evaluated.
Returns: True if the parameter is within the bounds, otherwise false.
Remarks: Always returns true if this curve is unbound.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified parameter is infinite.

Autodesk.Revit.DB.Curve.ComputeDerivatives(System.Double,System.Boolean)
Returns the vectors describing the curve at the specified parameter.
Remarks:
The following is the meaning of the transformation members:
Origin is the point on the curve (equivalent to Autodesk.Revit.DB.Curve.Evaluate(System.Double,System.Boolean)).BasisX is the tangent vector (the first derivative).BasisY is the second derivative.  Note that for curves where this cannot be uniquely determined (e.g. lines), this will be a Zero vector.BasisZ is the bi-normal vector (tangent x normal). Note that for curves where normal cannot be uniquely determined (e.g. lines), this will be a Zero vector.
None of the vectors are normalized.
parameter:
The parameter to be evaluated.
normalized:
If false, param is interpreted as natural parameterization of the curve.
If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Returns:
The transformation containing the point on the curve, the tangent vector, derivative of tangent vector, and bi-normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for parameter is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The curve cannot be evaluated as normalized because it is unbound.
-or-
The parameter is not a valid value for normalized evaluation.

Autodesk.Revit.DB.Curve.CreateOffset(System.Double,Autodesk.Revit.DB.XYZ)
Creates a new curve that is an offset of the existing curve.
Remarks:
The offset curve is obtained by moving the points of the given curve by a certain distance (not necessarily the input distance)
to the right relative to the reference vector. If the distance is negative, then the offset will be actually on the left side.
The precise role played by the reference vector depends on the curve type in an inconsistent way,
as specified in detail below. We plan to update this function to have a more consistent and understandable behavior.
For Line, HermiteSpline, NurbSpline and Cylindrical Helix, the right direction
is along the cross product of the tangent at that point and the reference vector.
In other words, the "right" side of the curve at a given point on the curve is defined with the reference vector
being thought of as the upward direction and curve tangent being thought of as the forward direction,
as if you are walking along the curve with your body aligned to the reference vector.  For Arc and Ellipse, the right direction is defined relative to the axis of the arc or ellipse
in conjunction with the reference vector. If the dot product of the reference vector with the axis is positive,
then the right direction is along the cross product of the curve tangent the axis.
If the dot product is negetive, then it is in the other way.
If the dot product is zero, then it is an input error.
More details of the behavior depending on the type of curve:
Line:
For a Line, a vecPerp is computed as the cross product of the line direction and the reference vector.
The offset is obtained by moving the line by the given distance along the direction of the vecPerp.
Note:  vecPerp can be zero vector if the reference vector is parallel to the line direction.
In that case, the offset is simply a copy of the given line. No error is reported.
Arc:
For an Arc, the offset is done in the plane of the arc.
The resulting offset is another arc in the same plane as the given arc and with the same center.
The radius is increased or decreased by the offset distance depending on the offset is to the right or left.
The reference vector is used to determine if the offset is to be done to the right or left of the arc,
based on the dot product of the reference vector with the axis (normal vector) of the arc.
If the dot product is positive then the offset is to the right relative to the axis of the arc; if not, it is to the left.
If the dot product is zero, that is, reference vector is perpendicular to the axis, the function will return NULL and report an error.
Ellipse:
An Ellipse is also a planar curve like the Arc. The offset is done in the plane of the ellipse.
Note that the offset of an ellipse is not an ellipse in general. It will be approximated by a Hermite spline curve.
The offset curve is obtained by offsetting the points of the ellipse, by the given offset distance, to the
right or left relative to the axis (normal vector) of the ellipse.
The reference vector is used to determine if the offset is to be done to the right or left of the ellipse,
based on the dot product of the reference vector with the axis of the ellipse.
If the dot product is positive then the offset is to the right relative to the axis of the ellipse; if not, it is to the left.
If the dot product is zero, that is, reference vector is perpendicular to the axis, the function will return NULL and report an error.
HermiteSpline, NurbSpline and Cylindrical Helix:
A Hermite or Nurbs spline curve can be planar or non-planar; a cylindrical helix is non-planar.
For these three types of curves, the offset is computed in a general way as follows:
Let P be a point on the given curve and let T be the unit tangent vector at P, assuming that the derivative
of the curve at P is not zero. The offset vector at P is the cross product of T and the reference vector.
Then the offset point Q corresponding to P is computed as:
Q = P + (offset distance) * (offset vector at P).
The offset depends on the magnitude as well as the direction of the reference vector.
If the magnitude of the reference vector is not one, then the actual distance moved will not be the given offset distance.
NOTE: If the curve is a planar Hermite or Nurbs spline curve, the offset curve may not lie on the same plane –
unlike the case of arc and ellipse.
offsetDist:
The signed distance that controls the offset.
referenceVector:
A reference vector to define the offset direction.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot create the offset of the curve.
Returns:
The new curve.
Since:
2015

Autodesk.Revit.DB.Curve.CreateReversed
Creates a new curve with the opposite orientation of the existing curve.
Returns:
The new curve.
Since:
2015

Autodesk.Revit.DB.Curve.CreateTransformed(Autodesk.Revit.DB.Transform)
Crates a new instance of a curve as a transformation of this curve.
transform:
The transform to apply.
Returns:
The new curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
transform is not conformal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Curve.Period
The period of this curve.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the curve is not cyclic.

Autodesk.Revit.DB.Curve.IsCyclic
The boolean value that indicates whether this curve is cyclic.
Returns: True if this curve is cyclic; otherwise, false.

Autodesk.Revit.DB.Curve.Distance(Autodesk.Revit.DB.XYZ)
Returns the shortest distance from the specified point to this curve.
point: The specified point.
Returns: The real number equal to the shortest distance.
Remarks: Returns the distance from the closest point on the curve to the specified point.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to find the closest point on the curve.

Autodesk.Revit.DB.Curve.Length
The exact length of the curve.
Remarks: Computes the length of the curve using analytical or numeric
integration. There is no performance hit for lines and arcs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the curve is unbound and not periodic.

Autodesk.Revit.DB.Curve.ApproximateLength
The approximate length of the curve.
Remarks: Quickly estimates the length of the curve, may deviate by a factor of 2 in some cases.
The computation is exact for lines and arcs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the curve is unbound and not periodic.

Autodesk.Revit.DB.Curve.ComputeRawParameter(System.Double)
Computes the raw parameter from the normalized parameter.
normalizedParameter: The normalized parameter.
Returns: The real number equal to the raw curve parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when normalizedParameter is infinite.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the curve is unbound.

Autodesk.Revit.DB.Curve.ComputeNormalizedParameter(System.Double)
Computes the normalized curve parameter from the raw parameter.
rawParameter: The raw parameter.
Returns: The real number equal to the normalized curve parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when rawParameter is infinite.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the curve is unbound.

Autodesk.Revit.DB.Curve.MakeUnbound
Makes this curve unbound.
Remarks: If the curve is marked as read-only (because it was extracted directly from
a Revit element or collection/aggregation object), calling this method
causes the object to be changed to carry a disconnected copy of the original curve.  The
modification will not affect the original curve or the object that supplied it.

Autodesk.Revit.DB.Curve.MakeBound(System.Double,System.Double)
Changes the bounds of this curve to the specified values.
Remarks: If the curve is marked as read-only (because it was extracted directly from
a Revit element or collection/aggregation object), calling this method
causes the object to be changed to carry a disconnected copy of the original curve.  The
modification will not affect the original curve or the object that supplied it.
startParameter: The new parameter of the start point.
endParameter: The new parameter of the end point.
Remarks: This method changes this curve to bound.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified values are infinite.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when endParameter is smaller than startParameter.

Autodesk.Revit.DB.Curve.GetEndParameter(System.Int32)
Returns the raw parameter value at the start or end of this curve.
Remarks:
The start and end value of the parameter can be any value (as it is determined by the system based on the inputs).
For curves with regular curvature like lines and arcs, the raw parameter can be used to measure along the curve in Revit's default units (feet).
Raw parameters are also the only way to evaluate points along unbound curves.
index:
0 for the start or 1 for end of the curve.
Returns:
The parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
curve is unbound and does not have start and end points.
-or-
index must be 0 for the start of the curve or 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Curve.GetEndPointReference(System.Int32)
Returns a stable reference to the start point or the end point of the curve.
index: Use 0 for the start point; 1 for the end point.
Returns: Reference to the point or null if reference cannot be obtained.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the specified index is not 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the object is internally marked as read-only or this curve is unbound.
Since: 2014

Autodesk.Revit.DB.Curve.GetEndPoint(System.Int32)
Returns the 3D point at the start or end of this curve.
index:
0 for the start or 1 for end of the curve.
Returns:
The curve endpoint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
curve is unbound and does not have start and end points.
-or-
index must be 0 for the start of the curve or 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Curve.Reference
Returns a stable reference to the curve.
This value is set for curve geometry obtained from Revit elements.
null if the curve was created via parameters, copying, transform, or other operations.
Remarks: This value is also  if the corresponding geometry object does not permit referencing.

Autodesk.Revit.DB.Curve.Evaluate(System.Double,System.Boolean)
Evaluates and returns the point that matches a parameter along the curve.
parameter:
The parameter to be evaluated.
normalized:
If false, param is interpreted as natural parameterization of the curve.
If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Returns:
The point evaluated along the curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for parameter is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The curve cannot be evaluated as normalized because it is unbound.
-or-
The parameter is not a valid value for normalized evaluation.

Autodesk.Revit.DB.Curve.Tessellate
Valid only if the curve is bound. Returns a polyline approximation to the curve.
Remarks: Tolerance of approximation is defined internally by Revit to be adequate for
display purposes.

Autodesk.Revit.DB.Curve.IsBound
Describes whether the parameter of the curve is restricted to a particular interval.

Autodesk.Revit.DB.Curve
A parametric curve.
Remarks: The concrete curves are defined by parametric equations. If the curve is
bound, it is only defined for an interval in parameterization. Otherwise, it is
defined for all values of the parameter.